In [49]:
# import libraries
import numpy as np
import pandas as pd
import seaborn as sns

In [50]:
# import dataset
data = sns.load_dataset('titanic')
data.head(6)

In [52]:
# how many missing values in dataset?
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

#### we will handle age column

In [53]:
# age column
age = data[['age']]
age.head(6)

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0
5   NaN

In [54]:
# how many missing values in age column?
age.isnull().sum()

age    177
dtype: int64

## Filling the missing values

In [55]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')

### strategy options: mean, median, most_frequent, constant

In [56]:
# the column has to be a numpy array, so convert the column to array
age = np.array(age)
type(age)

numpy.ndarray

In [57]:
# fill
filled_age = imputer.fit_transform(age)
filled_age[:6]

array([[22.        ],
       [38.        ],
       [26.        ],
       [35.        ],
       [35.        ],
       [29.69911765]])

In [58]:
# convert to integer
filled_age = filled_age.astype(int)
filled_age[:6]

array([[22],
       [38],
       [26],
       [35],
       [35],
       [29]])

In [59]:
# create new df column
filled_age = pd.DataFrame(filled_age, columns=['age'])
filled_age.head(6)

   age
0   22
1   38
2   26
3   35
4   35
5   29

In [60]:
data['age'] = filled_age
data.head(6)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,29,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True